APITestCreateOrder/Log/vtd_user.log

2021-07-27 18:21:48,374 [1] INFO  - Loaded appender: FileAppenderInternal
2021-07-27 18:21:48,403 [1] INFO  - Loaded appender: FileAppenderExternal
2021-07-27 18:21:48,404 [1] INFO  - Loaded appender: UserLoggerAppender
2021-07-27 18:21:48,404 [1] INFO  - Loaded appender: FileAppenderInternal
2021-07-27 18:21:48,405 [1] INFO  - Loaded appender: FileAppenderExternal
2021-07-27 18:21:48,405 [1] INFO  - Loaded appender: UserLoggerAppender
2021-07-27 18:21:49,646 [9] INFO  - Step 'Start' : Step 'Start' started
2021-07-27 18:21:49,750 [9] INFO  - Step 'Start' ended successfully
2021-07-27 18:21:49,758 [9] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2021-07-27 18:21:49,775 [9] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2021-07-27 18:21:49,779 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2021-07-27 18:21:49,816 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2021-07-27 18:21:50,058 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 18:21:50,244 [9] INFO  - Returning the response to the previous channel
2021-07-27 18:21:50,251 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2021-07-27 18:21:50,294 [9] INFO  - Structural Validation: True
2021-07-27 18:21:50,304 [9] INFO  - Step 'GetFlights' ended successfully
2021-07-27 18:21:50,307 [9] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2021-07-27 18:21:50,315 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>john</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2021-07-27 18:21:50,320 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 18:21:50,353 [9] INFO  - Returning the response to the previous channel
2021-07-27 18:21:50,356 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>793</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2021-07-27 18:21:50,364 [9] INFO  - Structural Validation: True
2021-07-27 18:21:50,370 [9] INFO  - Step 'CreateFlightOrder' ended successfully
2021-07-27 18:21:50,374 [9] INFO  - Step 'Iteration 1' ended successfully
2021-07-27 18:21:50,381 [9] INFO  - Step 'Iteration 2' : Step 'Iteration 2' started
2021-07-27 18:21:50,385 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2021-07-27 18:21:50,389 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2021-07-27 18:21:50,393 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 18:21:50,401 [9] INFO  - Returning the response to the previous channel
2021-07-27 18:21:50,405 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2021-07-27 18:21:50,417 [9] INFO  - Structural Validation: True
2021-07-27 18:21:50,422 [9] INFO  - Step 'GetFlights' ended successfully
2021-07-27 18:21:50,425 [9] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2021-07-27 18:21:50,431 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>john</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2021-07-27 18:21:50,436 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 18:21:50,452 [9] INFO  - Returning the response to the previous channel
2021-07-27 18:21:50,456 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>794</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2021-07-27 18:21:50,466 [9] INFO  - Structural Validation: True
2021-07-27 18:21:50,474 [9] INFO  - Step 'CreateFlightOrder' ended successfully
2021-07-27 18:21:50,477 [9] INFO  - Step 'Iteration 2' ended successfully
2021-07-27 18:21:50,480 [9] INFO  - Step 'Iteration 3' : Step 'Iteration 3' started
2021-07-27 18:21:50,485 [9] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2021-07-27 18:21:50,490 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Frankfurt</ArrivalCity>
      <FlightDate>2022-02-22T00:00:00+02:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2021-07-27 18:21:50,495 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 18:21:50,502 [9] INFO  - Returning the response to the previous channel
2021-07-27 18:21:50,511 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:53 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:09 AM</DepartureTime>
          <FlightNumber>14686</FlightNumber>
          <Price>179.47</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>10:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15779</FlightNumber>
          <Price>161.9</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>08:45 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15781</FlightNumber>
          <Price>105.4</Price>
        </Flight>
        <Flight>
          <Airline>AF</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:30 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>15782</FlightNumber>
          <Price>173.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>11:09 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>15785</FlightNumber>
          <Price>104</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:33 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>15789</FlightNumber>
          <Price>106</Price>
        </Flight>
        <Flight>
          <Airline>DL</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>04:42 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15792</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>03:57 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>15793</FlightNumber>
          <Price>105.3</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>06:29 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:45 PM</DepartureTime>
          <FlightNumber>16102</FlightNumber>
          <Price>110.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Frankfurt</ArrivalCity>
          <ArrivalTime>01:41 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:57 PM</DepartureTime>
          <FlightNumber>16396</FlightNumber>
          <Price>120.4</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2021-07-27 18:21:50,521 [9] INFO  - Structural Validation: True
2021-07-27 18:21:50,528 [9] INFO  - Step 'GetFlights' ended successfully
2021-07-27 18:21:50,531 [9] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2021-07-27 18:21:50,538 [9] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>john</CustomerName>
        <DepartureDate>2022-02-22T00:00:00+02:00</DepartureDate>
        <FlightNumber>14686</FlightNumber>
        <NumberOfTickets>5</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2021-07-27 18:21:50,551 [9] INFO  - URL: http://localhost:8000/Flights_SOAP
2021-07-27 18:21:50,569 [9] INFO  - Returning the response to the previous channel
2021-07-27 18:21:50,572 [9] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>795</OrderNumber>
        <TotalPrice>1794.7</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2021-07-27 18:21:50,580 [9] INFO  - Structural Validation: True
2021-07-27 18:21:50,585 [9] INFO  - Step 'CreateFlightOrder' ended successfully
2021-07-27 18:21:50,589 [9] INFO  - Step 'Iteration 3' ended successfully
2021-07-27 18:21:50,601 [9] INFO  - Step 'Test Flow' ended successfully
2021-07-27 18:21:50,604 [9] INFO  - Step 'End' : Step 'End' started
2021-07-27 18:21:50,692 [9] INFO  - Step 'End' ended successfully
